week3/pokeverse/app/controllers/access_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["username", "cgaribay"], ["LIMIT", 1]]
---
  def attempt_login
    if params[:username].present? && params[:password].present?
      found_user = User.where(:username => params[:username]).first