week3/pokeverse/app/controllers/pokemon_cards_controller.rb

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."user_id" = $1 ORDER BY created_at ASC  [["user_id", 2]]
---
  def index
    @pokemon_cards = PokemonCard.where(:user_id => session[:user_id]).order("created_at ASC")

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @pokemon_card = PokemonCard.find(params[:id])

SELECT "pokemons".* FROM "pokemons" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @pokemon_card = PokemonCard.new(:defense => 2)
    @pokemon_card.pokemon = Pokemon.order(Arel.sql('RANDOM()')).first
    PokemonCard.number_of_moves.times { @pokemon_card.pokemon_card_moves << PokemonCardMove.create(:is_ability => false) }
    @pokemon_card.pokemon_card_moves << PokemonCardMove.create(:is_ability => true)
    @pokemon_card.user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pokemon_card_moves" ("pokemon_card_id", "move_id", "type_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["pokemon_card_id", 3], ["move_id", 5], ["type_id", 1], ["created_at", "2021-09-14 22:13:24.975391"], ["updated_at", "2021-09-14 22:13:24.975391"], ["description", "a"]]
INSERT INTO "pokemon_cards" ("pokemon_id", "defense", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pokemon_id", 2], ["defense", 2], ["user_id", 2], ["created_at", "2021-09-14 20:48:12.595112"], ["updated_at", "2021-09-14 20:48:12.595112"]]
SELECT "moves".* FROM "moves" WHERE "moves"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "moves".* FROM "moves" WHERE "moves"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "pokemon_card_tokens" ("pokemon_card_id", "type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pokemon_card_id", 2], ["type_id", 1], ["created_at", "2021-09-14 20:48:12.608513"], ["updated_at", "2021-09-14 20:48:12.608513"]]
---
  def create
    @pokemon_card = PokemonCard.new(:defense => pokemon_card_params_for_create[:defense].to_i)
    @pokemon_card.user = User.find(session[:user_id])
    @pokemon_card.pokemon = Pokemon.find(pokemon_card_params_for_create[:pokemon_id].to_i)

    pokemon_card_params_for_create[:pokemon_card_moves_attributes].each do |key, move|
      pcm = PokemonCardMove.create(
        :cost => move[:cost].to_i,
        :description => move[:description],
        :is_ability => false)
      pcm.move = Move.find(move[:move_id].to_i)
      pcm.type = Type.find(move[:type_id].to_i)
      @pokemon_card.pokemon_card_moves << pcm
    end
    pca = PokemonCardMove.create(
      :is_ability => true,
      :description => pokemon_card_params_for_create[:pokemon_card_move][:description],
      :cost => 0
    )
    pca.move = Move.find(pokemon_card_params_for_create[:pokemon_card_move][:move_id].to_i)
    @pokemon_card.pokemon_card_moves << pca

    pokemon_card_params_for_create[:pokemon_card_tokens_attributes].each do |key, token|
      pct = PokemonCardToken.create
      pct.type = Type.find(token[:type_id].to_i)
      @pokemon_card.pokemon_card_tokens << pct
    end

    if @pokemon_card.save

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @pokemon_card = PokemonCard.find(params[:id])

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "moves".* FROM "moves" WHERE "moves"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "pokemon_card_moves".* FROM "pokemon_card_moves" WHERE "pokemon_card_moves"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemon_cards" SET "defense" = $1, "updated_at" = $2 WHERE "pokemon_cards"."id" = $3  [["defense", 1], ["updated_at", "2021-09-14 21:35:35.248658"], ["id", 1]]
UPDATE "pokemon_card_moves" SET "move_id" = $1, "cost" = $2, "type_id" = $3, "updated_at" = $4, "description" = $5 WHERE "pokemon_card_moves"."id" = $6  [["move_id", 6], ["cost", 2], ["type_id", 4], ["updated_at", "2021-09-14 22:13:59.153017"], ["description", "bb"], ["id", 10]]
SELECT "pokemon_card_moves".* FROM "pokemon_card_moves" WHERE "pokemon_card_moves"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "moves".* FROM "moves" WHERE "moves"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "pokemon_card_moves" SET "move_id" = $1, "updated_at" = $2, "description" = $3 WHERE "pokemon_card_moves"."id" = $4  [["move_id", 6], ["updated_at", "2021-09-14 22:13:59.174338"], ["description", "bbbb"], ["id", 12]]
SELECT "pokemon_card_tokens".* FROM "pokemon_card_tokens" WHERE "pokemon_card_tokens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pokemon_card_tokens" SET "type_id" = $1, "updated_at" = $2 WHERE "pokemon_card_tokens"."id" = $3  [["type_id", 3], ["updated_at", "2021-09-14 21:35:35.238552"], ["id", 2]]
---
  def update
    @pokemon_card = PokemonCard.find(params[:id])
    @pokemon_card.defense = pokemon_card_params_for_create[:defense].to_i

    pokemon_card_params_for_create[:pokemon_card_moves_attributes].each do |key, move|
      pcm = PokemonCardMove.find(move[:id].to_i)
      unless pcm.is_ability
        pcm.cost = move[:cost].to_i
        pcm.description = move[:description]
        pcm.move = Move.find(move[:move_id].to_i)
        pcm.type = Type.find(move[:type_id].to_i)
        pcm.save
      end
    end
    pca = PokemonCardMove.find(pokemon_card_params_for_create[:pokemon_card_move][:id].to_i)
    pca.description = pokemon_card_params_for_create[:pokemon_card_move][:description]
    pca.move = Move.find(pokemon_card_params_for_create[:pokemon_card_move][:move_id].to_i)
    pca.save

    pokemon_card_params_for_create[:pokemon_card_tokens_attributes].each do |key, token|
      pct = PokemonCardToken.find(token[:id].to_i)
      pct.type = Type.find(token[:type_id].to_i)
      pct.save
    end

    if @pokemon_card.save

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def delete
    @pokemon_card = PokemonCard.find(params[:id])

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1  [["id", 1]]
---
  def destroy
    @pokemon_card = PokemonCard.find(params[:id])
    @pokemon_card.destroy