week3/pokeverse/app/controllers/pokemons_controller.rb

  def show
    @pokemon = Pokemon.find(params[:id])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def load_new_pokemon
    last = Pokemon.all.size == 0 ? 0 : Pokemon.order("pokeapi_id DESC").first.pokeapi_id
    if last < Pokemon.max_pokemon
      end_limit = (last + LIMIT) > Pokemon.max_pokemon ? Pokemon.max_pokemon : last + LIMIT
      (last+1..end_limit).each do |id|
        pokemon = PokeApi.get(pokemon: id)
        pokemon_record = Pokemon.create(
          :pokeapi_id => pokemon.id,
          :name => pokemon.name,
          :image_url => pokemon.sprites.front_default
        )
        pokemon.moves.each do |tmp_move|
          if Move.where(:name => tmp_move.move.name).empty?
            move = PokeApi.get(move: tmp_move.move.name)
            move_record = Move.create(
              :pokeapi_id => move.id,
              :name => move.name
            )
          else
            move_record = Move.where(:name => tmp_move.move.name).first
          end
          pokemon_record.moves << move_record
---
SELECT "pokemons".* FROM "pokemons" ORDER BY pokeapi_id DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "pokemons"
INSERT INTO "pokemons" ("pokeapi_id", "name", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "moves".* FROM "moves" INNER JOIN "pokemon_moves" ON "moves"."id" = "pokemon_moves"."move_id" WHERE "pokemon_moves"."pokemon_id" = $1  [["pokemon_id", 2]]
SELECT 1 AS one FROM "moves" WHERE "moves"."name" = $1 LIMIT $2  [["name", "string-shot"], ["LIMIT", 1]]
INSERT INTO "moves" ("pokeapi_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pokeapi_id", 106], ["name", "harden"], ["created_at", "2021-09-20 16:36:41.729060"], ["updated_at", "2021-09-20 16:36:41.729060"]]
SELECT "moves".* FROM "moves" WHERE "moves"."name" = $1 ORDER BY "moves"."id" ASC LIMIT $2  [["name", "string-shot"], ["LIMIT", 1]]
INSERT INTO "moves" ("pokeapi_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pokeapi_id", 13], ["name", "razor-wind"], ["created_at", "2021-09-15 00:31:38.440460"], ["updated_at", "2021-09-15 00:31:38.440460"]]