week3/pokeverse/app/controllers/pokeverse_api_controller.rb

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."user_id" = $1 ORDER BY created_at ASC  [["user_id", 2]]
---
  def index
    result_object = {
      pokemon_cards: []
    }
    pokemon_cards = PokemonCard.where(:user_id => session[:user_id]).order("created_at ASC")
    pokemon_cards.each do |pc|

DELETE FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1  [["id", 5]]
---
  def destroy
    @pokemon_card.destroy

SELECT "pokemon_cards".* FROM "pokemon_cards" WHERE "pokemon_cards"."id" = $1 AND "pokemon_cards"."user_id" = $2 ORDER BY "pokemon_cards"."id" ASC LIMIT $3  [["id", 4], ["user_id", 2], ["LIMIT", 1]]
---
    def set_pokemon_card
      @pokemon_card = PokemonCard.where(:id => params[:id], :user_id => session[:user_id]).first

SELECT id, pokeapi_id, name FROM "pokemons"
SELECT "pokemon_card_tokens".* FROM "pokemon_card_tokens" WHERE "pokemon_card_tokens"."pokemon_card_id" = $1  [["pokemon_card_id", 4]]
SELECT "pokemon_card_moves".* FROM "pokemon_card_moves" WHERE "pokemon_card_moves"."pokemon_card_id" = $1  [["pokemon_card_id", 4]]
---
    def set_result_object(pc)
      result_card = {
        id: pc.id,
        pokemon_id: pc.pokemon.pokeapi_id,
        pokemon_name: pc.pokemon.name,
        defense: pc.defense,
        tokens: [
          pc.pokemon_card_tokens[0].type.color,
          pc.pokemon_card_tokens[1].type.color
        ],
        moves: []
      }
      pc.pokemon_card_moves.each do |pcm|