week3/pokeverse/app/controllers/users_controller.rb

SELECT "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "user_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.user_type = UserType.find(params[:user][:user_type])
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "user_types".* FROM "user_types" WHERE "user_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "user_type_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$12$e8IMlAWjPYKlvVxiS29dz.tBtQzhN3oc3APP/cZiuDfcKVkKPHwBy"], ["user_type_id", 2], ["updated_at", "2021-09-10 17:10:45.087121"], ["id", 4]]
---
  def update
    @user = User.find(params[:id])
    @user.user_type = UserType.find(params[:user][:user_type])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def delete
    @user = User.find(params[:id])

SELECT "user_types".* FROM "user_types" ORDER BY user_type ASC
---
    def user_types_for_select
      UserType.order("user_type ASC").map do |user_type|