week3/pokeverse/app/views/users/index.html.erb

SELECT "users".* FROM "users" ORDER BY last_name ASC, first_name ASC
SELECT COUNT(*) FROM "users"
---

  <div><%= pluralize(@users.size, 'user') %> found</div>