week3/pokeverse/app/views/pokemon_cards/_form.html.erb

    <th><%= pcm.label(:type) %></th>
    <td><%= pcm.collection_select(:type_id, Type.order(:color), :id, :color) %></td>
---
SELECT "types".* FROM "types" ORDER BY "types"."color" ASC

    <th><%= pct.label(:type) %></th>
    <td><%= pct.collection_select(:type_id, Type.order(:color), :id, :color) %></td>
---
SELECT "types".* FROM "types" ORDER BY "types"."color" ASC