week3/pokeverse/app/views/pokemon_cards/delete.html.erb

SELECT "pokemon_card_moves".* FROM "pokemon_card_moves" WHERE "pokemon_card_moves"."pokemon_card_id" = $1  [["pokemon_card_id", 1]]
---
    <h4>Moves</h4>
    <% f.object.pokemon_card_moves.each do |pcm| %>