week3/pokeverse/app/views/pokemon_cards/show.html.erb

SELECT "pokemon_card_moves".* FROM "pokemon_card_moves" WHERE "pokemon_card_moves"."pokemon_card_id" = $1  [["pokemon_card_id", 1]]
---
    </tr>
    <% @pokemon_card.pokemon_card_moves.each do |card_move| %>

SELECT "pokemon_card_tokens".* FROM "pokemon_card_tokens" WHERE "pokemon_card_tokens"."pokemon_card_id" = $1  [["pokemon_card_id", 1]]
---
    </tr>
    <% @pokemon_card.pokemon_card_tokens.each do |card_token| %>