week3/pokeverse/app/views/pokemons/index.html.erb

SELECT "pokemons".* FROM "pokemons" ORDER BY pokeapi_id ASC
SELECT COUNT(*) FROM "pokemons"
---

  <div><%= pluralize(@pokemons.size, 'pokemon') %> found</div>