week3/pokeverse/app/views/pokemons/show.html.erb

    </tr>
    <% @pokemon.moves.each do |move| %>
---
SELECT "moves".* FROM "moves" INNER JOIN "pokemon_moves" ON "moves"."id" = "pokemon_moves"."move_id" WHERE "pokemon_moves"."pokemon_id" = $1  [["pokemon_id", 2]]